import TestPage from "./TestPage";

const test1questions = [
  {
    id: "01",
    text: "هل تشعرين برغبة مفاجئة وملحة في الأكل حتى لو كنتِ قد تناولتِ وجبتكِ قبل وقت قصير؟",
    why: " تمييز التوقيت المفاجئ للجوع العاطفي",
  },
  {
    id: "02",
    text: "عندما تشعرين بالتوتر أو الضغط، هل تبحثين عن نوع محدد من الطعام (مثل الحلويات أو المقرمشات) بدلاً من أي وجبة صحية متاحة؟",
    why: "'كشف الرغبة في 'أطعمة الراحة",
  },
  {
    id: "03",
    text: "هل تجدين نفسكِ تأكلين دون وعي بالكمية أثناء مشاهدة التلفاز أو تصفح الهاتف عندما تكونين وحيدة؟",
    why: "قياس مستوى الأكل اللاواعي",
  },

  {
    id: "04",
    text: "هل يستمر شعوركِ بالرغبة في الأكل حتى بعد أن تشعري بامتلاء معدتكِ بشكل مزعج؟",
    why: "ملاحظة تجاهل إشارات الشبع الجسدية",
  },
  {
    id: "05",
    text: "هل تشعرين بالندم أو الذنب أو الخجل بعد تناول كميات كبيرة من الطعام؟",
    why: " رصد التبعات النفسية للأكل العاطفي",
  },
  {
    id: "06",
    text: "هل تستخدمين الطعام كمكافأة لنفسكِ بعد يوم عمل شاق أو لإسكات مشاعر الحزن والملل؟",
    why: "تحديد الطعام كوسيلة دفاعية",
  },
  {
    id: "07",
    text: "هل تشعرين أن (الجوع) الذي تمرين به يتركز في رأسكِ (تفكير مستمر بنوع معين) وليس في معدتكِ (قرقرة أو فراغ)؟",
    why: "تحديد مصدر الجوع",
  },
  {
    id: "08",
    text: "هل تميلين لتناول الطعام بسرعة كبيرة وكأنكِ في سباق عندما تكونين منزعجة؟",
    why: "ملاحظة سرعة التناول المرتبطة بالحالة النفسية",
  },
  {
    id: "09",
    text: "هل تجدين صعوبة في التوقف عن الأكل بمجرد البدء، خاصة في الأطعمة التي تحبينها؟",
    why: "قياس درجة السيطرة",
  },
  {
    id: "10",
    text: "هل تشعرين أن الطعام هو 'صديقكِ الوحيد' الذي يفهمكِ أو يواسيكِ في اللحظات الصعبة؟",
    why: "كشف الارتباط العاطفي العميق بالطعام)",
  },
];
const options1 = ["نعم", "لا"];

export default function test1() {
  return (
    <TestPage
      name="اختبار الأكل العاطفي"
      goal=" أجِب بـ(نعم/لا) على 10 أسئلة لكشف مدى تأثير العواطف على أكلِك، وتحليل بسيط للنتائج يوجهك نحو الخطوة التالية."
      questions={test1questions}
      options={options1}
      result={"this is the result"}
    />
  );
}
//  expanded={current === index}
