import TestPage from "./TestPage";

const test2questions = [
  {
    id: 1,
    text: "هل تجدين نفسكِ تقارنين شكل جسمكِ بأجسام الأخريات (سواء في الواقع أو عبر وسائل التواصل) وتشعرين بالدونية؟",
    why: " قياس حدة المقارنة الاجتماعية",
  },
  {
    id: 2,
    text: "هل تتجنبين النظر في المرآة، أو على العكس، هل تبالغين في فحص عيوب معينة في جسمكِ بشكل متكرر يومياً؟",
    why: " 'رصد سلوكيات 'التفحص' أو 'التجنب",
  },
  {
    id: 3,
    text: "هل يؤثر شعوركِ تجاه جسمكِ على رغبتكِ في الخروج ومقابلة الناس أو المشاركة في فعاليات اجتماعية؟",
    why: "قياس درجة العزلة الاجتماعية المرتبطة بالشكل",
  },
  {
    id: 4,
    text: "هل تختارين ملابس واسعة جداً أو معينة بهدف 'إخفاء' أجزاء من جسمكِ تشعرين بالخجل منها؟",
    why: " كشف سلوكيات التمويه",
  },
  {
    id: 5,
    text: "هل تربطين قيمتكِ كإنسانة ومدى استحقاقكِ للحب والنجاح بوزنكِ أو شكل جسمكِ فقط؟",
    why: "'رصد 'الاستحقاق المشروط",
  },
  {
    id: 6,
    text: "هل تشعرين بالانزعاج أو التوتر الشديد إذا لم تتمكني من ممارسة الرياضة أو الالتزام بنظام غذائي صارم ليوم واحد؟",
    why: "قياس الهوس بالسيطرة على الجسم",
  },
  {
    id: 7,
    text: "هل ترفضين التقاط الصور الفوتوغرافية مع العائلة أو الأصدقاء خوفاً من كيف سيبدو شكلكِ فيها؟",
    why: "رصد القلق من التوثيق البصري",
  },
  {
    id: 8,
    text: "هل تسمعين 'صوتاً داخلياً' ناقداً وقاسياً يوجه لكِ تعليقات سلبية عن مظهركِ باستمرار؟",
    why: "تقييم الحوار الذاتي السلبي",
  },
  {
    id: 9,
    text: "هل تفكرين في إجراء عمليات تجميلية أو إجراءات جذرية لتغيير جزء معين من جسمكِ بشكل مستمر؟",
    why: "قياس درجة عدم القبول الذاتي",
  },
  {
    id: 10,
    text: "هل تشعرين أن الآخرين يراقبون عيوب جسمكِ وينتقدونها سراً بمجرد دخولكِ إلى مكان ما؟",
    why: " رصد القلق الاجتماعي المرتبط بالجسم",
  },
];
const options2 = ["دائماً", "أحياناً", "نادراً"];

export default function Test2() {
  return (
    <TestPage
      name="اختبار اضطراب صورة الجسد "
      goal="قيّمي رضاكِ عن جسمكِ بـ(دائماً، أحياناً، نادراً) على 10 أسئلة تساعدك تفهمين كيف ينظر عقلكِ لجسدكِ.  "
      questions={test2questions}
      options={options2}
      result={"this is the result"}
    />
  );
}
