import TestPage from "./TestPage";

const test3questions = [
  {
    id: "01",
    text: "هل تشعرين بالذنب أو القلق الشديد إذا تناولتِ وجبة 'غير صحية' أو خرجتِ عن نظامكِ الغذائي لمرة واحدة؟",
    why: "قياس المرونة النفسية تجاه الطعام",
  },
  {
    id: "02",
    text: "هل تقضين أكثر من 3 ساعات يومياً في التفكير في الطعام الصحي، تخطيط الوجبات، أو قراءة الملصقات الغذائية بدقة مبالغ فيها؟",
    why: "صد الاستحواذ الفكري على الوقت",
  },
  {
    id: "03",
    text: "هل تعتمد قيمتكِ الذاتية وشعوركِ بالرضا يومياً على 'الأرقام' (الوزن، السعرات الحرارية، عدد الخطوات، أو ساعات الرياضة)؟",
    why: "كشف الارتباط الشرطي بالأرقام",
  },
  {
    id: "04",
    text: "هل تتجنبين المناسبات الاجتماعية أو تناول الطعام مع الأصدقاء خوفاً من عدم توفر أكل يتناسب مع معاييركِ الصارمة؟",
    why: "قياس درجة العزلة الاجتماعية بسبب النظام الغذائي",
  },
  {
    id: "05",
    text: "هل ترفضين تناول أطعمة تحبينها فقط لأنها لا تعتبر 'نقية' أو 'عضوية' أو'صحية' تماماً وفق نظرتكِ؟",
    why: "رصد التقييد الصارم للأصناف",
  },
  {
    id: "06",
    text: "هل تمارسين الرياضة حتى عندما تشعرين بالتعب الشديد، المرض، أو الإصابة، فقط لتجنب الشعور بالذنب؟",
    why: " قياس الهوس الرياضي القهري",
  },
  {
    id: "07",
    text: "هل تشعرين بالتوتر الشديد إذا لم تتمكني من تتبع سعراتكِ أو خطواتكِ عبر التطبيقات الذكية ليوم واحد؟",
    why: "رصد الاعتماد الكلي على التكنولوجيا في التقييم",
  },
  {
    id: "08",
    text: "ل تنظرين بدون قصد بـ 'فوقية' أو استغراب لمن لا يتبعون نظامكِ الصحي الصارم وتجدين صعوبة في تقبل خياراتهم؟",
    why: "كشف الأحكام الأخلاقية المرتبطة بالطعام",
  },
  {
    id: "09",
    text: "هل تشعرين أن هوسكِ بالصحة والرياضة بدأ يؤثر سلباً على مجالات أخرى في حياتك (العمل، العلاقات، أو الدراسة)؟",
    why: "قياس مدى الخلل الوظيفي في الحياة",
  },
  {
    id: "10",
    text: "هل تشعرين بـ 'السيطرة التامة' فقط عندما تلتزمين بالخطة الغذائية والرياضية، وتنهار هذه السيطرة تماماً عند أي تغيير بسيط؟",
    why: " رصد الحاجة المفرطة للتحكم",
  },
];
const options3 = ["نعم", "لا"];

export default function Test3() {
  return (
    <TestPage
      name="اختبار الهوس الصحي"
      goal=" أجِب بـ(نعم/لا) على 10 أسئلة لكشف هل إهتمامك بصحتك تحول إلى هوس؟، وتحليل بسيط للنتائج يوجهك نحو الخطوة التالية."
      questions={test3questions}
      options={options3}
      result={"this is the result"}
    />
  );
}
